In [2]:
def check_palindrome(word):
    return word

In [3]:
check_palindrome('ajay')

'ajay'

In [4]:
a = 'lucky'
a[::-1]

'ykcul'

In [6]:
a = 'nitin'
if a == a[::-1]:
    print(f'{a} is a palindrome')
else:
    print(f'{a} not a palindrome')

nitin is a palindrome

In [13]:
def check_palindrome(word):
    if type(word) == str:
        word = word.upper()
        if word == word[::-1]:
            return 'palindrome'
        else:
            return 'not a palindrome'
    else:
        return 'invalid Data Type'

In [15]:
check_palindrome('dog')

'not a palindrome'

In [10]:
check_palindrome('nitin')

'palindrome'

In [19]:
def give_fibo(n):
    fibo=[0,1]
    for i in range(n-2):
        last_num = fibo[-1]
        second_last_num = fibo[-2]
        next_num = last_num + second_last_num
        fibo.append(next_num)
    return fibo

In [22]:
print(give_fibo(10))

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [25]:
def check_prime(number):
    for i in range(2,number):
        if number % i == 0:
            return 'not a Prime Number'
            break
    else:
        return 'prime number'

In [26]:
check_prime(23)

'prime number'

In [27]:
check_prime(35)

'not a Prime Number'

In [31]:
n=5
for i in range(1,n+1):
    print(i*'* ')

*
* *
* * *
* * * *
* * * * *

In [39]:
n=5
for i in range(1,n+1):
    print(' '*(n-i) + i*'* ')

    *
   * *
  * * *
 * * * *
* * * * *

In [59]:
def print_star(n=5, typ = 'left'):
    if typ == 'left':
        space = ''
    elif typ == 'right':
        space = '  '
    elif typ == 'mid':
        space = ' '
    for i in range(1,n+1):
        print(space*(n-i) + i*'* ')

In [60]:
print_star(3)

*
* *
* * *

In [61]:
print_star(3,'right')

    *
  * *
* * *

In [62]:
print_star(5,'mid')

    *
   * *
  * * *
 * * * *
* * * * *

In [67]:
def print_star(n=5, typ = 'left',shape='*'):
    if typ == 'left':
        space = ''
    elif typ == 'right':
        space = '  '
    elif typ == 'mid':
        space = ' '
    for i in range(1,n+1):
        print(space*(n-i) + i*f'{shape} ')

In [68]:
print_star(5,'right','#')

        #
      # #
    # # #
  # # # #
# # # # #

In [69]:
print_star(5,'right','^')

        ^
      ^ ^
    ^ ^ ^
  ^ ^ ^ ^
^ ^ ^ ^ ^

In [70]:
print_star(5,'mid','#')

    #
   # #
  # # #
 # # # #
# # # # #

In [71]:
print_star(5,'left','#')

#
# #
# # #
# # # #
# # # # #

In [72]:
def sum_of_n_natural_numbers(n):
    result = 0
    for i in range(1,n+1):
        result +=i
    return result

In [75]:
sum_of_n_natural_numbers(10)

55

In [77]:
def factorial(n):
    result=1
    for i in range(1,n+1):
        result *= i
    return result

In [78]:
factorial(5)

120

In [79]:
factorial(3)

6

In [81]:
def total_sales(*args):
    result = 0
    for i in args:
        result+=i
    return result

In [82]:
total_sales(1,2,3,4,455)

465

In [83]:
sales = [44,3,4354,43,35,4,54,5,45,535]

In [101]:
min_element = sales[0]
for i in sales[1:]:
    if i < min_element:
        min_element = i
print(min_element)

3

In [112]:

def total_sales(*data):
    max_element = data[1]
    for i in data[1:]:
        if i > max_element:
            max_element = i
    print(max_element)

In [113]:
total_sales(32,2,4,34,3323,3)

3323

In [107]:
def minn(*data):
    min_ele = data[0]
    for i in data[1:]:
        if i < min_ele:
            min_ele = i
    return min_ele

In [106]:
minn(37.34344,63,46,4,3,46,3,634,6,346)

3

In [108]:
minn(2342.4,34534,54,54,5)

5

In [121]:
company = ['ola','uber','rapido','indrive','adani','tata']
def add_hashtag(*company):
    result=[]
    for i in company:
        result.append('#'+i.upper())
    return result

In [122]:
add_hashtag(*company)

['#OLA', '#UBER', '#RAPIDO', '#INDRIVE', '#ADANI', '#TATA']

In [127]:
def store_records(name,age,sec,roll_no,Class):
    data = {'name':name, 'age':age, 'sec':sec, 'roll_no':roll_no, 'Class':Class}
    import pandas as pd
    result= pd.DataFrame(data,index=[1])
    return result

In [128]:
store_records('karan',20,'A',12,12)

    name  age sec  roll_no  Class
1  karan   20   A       12     12

In [129]:
display(store_records('karan',20,'A',12,12))
display(store_records('mohan',20,'A',12,12))
display(store_records('naman',20,'A',12,12))

    name  age sec  roll_no  Class
1  karan   20   A       12     12

    name  age sec  roll_no  Class
1  mohan   20   A       12     12

    name  age sec  roll_no  Class
1  naman   20   A       12     12

In [131]:
def students_records(**kwargs):
    print(kwargs)
    keys = list(kwargs)
    if type(keys[0]) == str:
        import pandas as pd
        result = pd.DataFrame(kwargs,index=[1])
        return result
    else:
        result = pd.DataFrame(kwargs)
        return result

In [ ]:
student_records(name= 'ayan', age=20, sec = 'E2', roll_no=75, address='delhi')